Autodesk.Navisworks.Api.SavedItemCollection
Collection of SavedItems that stores the children
of a Autodesk.Navisworks.Api.GroupItem.

Autodesk.Navisworks.Api.SavedItemCollection.Add(Autodesk.Navisworks.Api.SavedItem)
Adds item to the end of the collection.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.SavedItemCollection.AddRange(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.SavedItem})
Add the items of the specified collection to the SavedItemCollection
from: The collection to add items from

Autodesk.Navisworks.Api.SavedItemCollection.CanAdd(Autodesk.Navisworks.Api.SavedItem)
Determines whether item can be added to the collection.
Returns:
false if item is ReadOnly or of an incompatible type

Autodesk.Navisworks.Api.SavedItemCollection.Clear
Removes all items from the collection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SavedItemCollection.Contains(Autodesk.Navisworks.Api.SavedItem)
Determines whether the SavedItemCollection contains a specific value.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.SavedItemCollection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.SavedItem})
Sets the contents of the collection to the items in from
from: The collection to copy contents from

Autodesk.Navisworks.Api.SavedItemCollection.CopyTo(Autodesk.Navisworks.Api.SavedItem[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.SavedItemCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.SavedItem})
Enumerates over the collection and copies the items into to
to: Collection to copy into

Autodesk.Navisworks.Api.SavedItemCollection.Count
Gets the number of elements contained in the collection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItemCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that
can be used to iterate through the collection.

Autodesk.Navisworks.Api.SavedItemCollection.IndexOf(Autodesk.Navisworks.Api.SavedItem)
Determines the index of a specific item in the SavedItemCollection
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.SavedItemCollection.IndexOfDisplayName(System.String)
Determines the index of the first item in the collection with the specified DisplayName
Returns:
Index of first item or -1 if none found

Autodesk.Navisworks.Api.SavedItemCollection.IndexOfGuid(System.Guid)
Determines the index of the first item in the collection with the specified guid
Returns:
Index of first item or -1 if none found

Autodesk.Navisworks.Api.SavedItemCollection.Insert(System.Int32,Autodesk.Navisworks.Api.SavedItem)
Inserts item into the collection at the specified index
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.SavedItemCollection.IsReadOnly
Gets a value indicating whether the collection is read-only.

Autodesk.Navisworks.Api.SavedItemCollection.Item(System.Int32)


Autodesk.Navisworks.Api.SavedItemCollection.Remove(Autodesk.Navisworks.Api.SavedItem)
Removes the first occurrence of a specific item from the collection.
item: The object to remove from the collection.
Returns: true if item was successfully removed from the collection; otherwise, false.
This method also returns false if item is not found in the original collection.
Throws System.NotSupportedException: The collection is read-only.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly

Autodesk.Navisworks.Api.SavedItemCollection.RemoveAt(System.Int32)
Removes the  item at the specified index.
index: The zero-based index of the item to remove.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.SavedItemCollection.Sort
Performs a case-insensitive lexicographical sort of the items in the collection.
Folders sort to top (like Windows Explorer).

Autodesk.Navisworks.Api.SavedItemCollection.SortDescendantsAndSelf
Performs a case-insensitive lexicographical sort of the items in the collection.
Folders sort to top (like Windows Explorer).